---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.Clear
source: html/4a711573-b29e-a440-2735-d1ca128fd769.htm
---
# Autodesk.Revit.DB.PhaseArray.Clear Method

Removes every phase from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```